Revit 2027 API
ExtendedPropertiesLinkValues Methods
The ExtendedPropertiesLinkValues type exposes the following members.
Methods
Name | Description
AddValue(ForgeTypeId, Double) |  Add a double value for a given schema id.
AddValue(ForgeTypeId, Int32) |  Add an integer value for a given schema id.
AddValue(ForgeTypeId, String) |  Add a string value for a given schema id.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExtendedPropertiesLinkValues Class
Autodesk.Revit.DB.ExternalData Namespace